---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesTopDirn2
source: html/d8e922fe-4318-8a72-739d-e95b4d85f196.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesTopDirn2 Property

"Top Minor Number Of Lines"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemNumberOfLinesTopDirn2 { get; }
```